In [9]:
import pandas as pd
import numpy as np 
s = pd.Series(np.random.randn(5))

In [16]:
df = pd.DataFrame(s, columns= ['Column 1'])
df

   Column 1
0 -0.867922
1  0.231770
2  2.062653
3  0.620489
4  0.645915

In [17]:
df['Column 1']

0   -0.867922
1    0.231770
2    2.062653
3    0.620489
4    0.645915
Name: Column 1, dtype: float64

In [18]:
df['Column 2'] = df['Column 1']*4

In [19]:
df

   Column 1  Column 2
0 -0.867922 -3.471690
1  0.231770  0.927079
2  2.062653  8.250611
3  0.620489  2.481956
4  0.645915  2.583660

In [20]:
df.sort_values(by = 'Column 2')

   Column 1  Column 2
0 -0.867922 -3.471690
1  0.231770  0.927079
3  0.620489  2.481956
4  0.645915  2.583660
2  2.062653  8.250611

In [21]:
df['Column 3'] = df['Column 1'] + df['Column 2']

In [22]:
df

   Column 1  Column 2   Column 3
0 -0.867922 -3.471690  -4.339612
1  0.231770  0.927079   1.158849
2  2.062653  8.250611  10.313263
3  0.620489  2.481956   3.102445
4  0.645915  2.583660   3.229575